# Usage: brew bundle --file=Brewfile

tap "hashicorp/tap"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "mongodb/brew"
tap "smudge/smudge"

brew "git"                       
brew "gh"                        
brew "neovim"                     
brew "tmux"                       
brew "curl"                       
brew "wget"                       

brew "lua-language-server"
# brew "typescript-language-server"  
brew "bash-language-server"
brew "vscode-langservers-extracted"

brew "fzf"                          
brew "ripgrep"                      
brew "tree"                         
brew "yazi"                         
brew "zsh-autosuggestions"          
brew "zsh-syntax-highlighting"      
brew "sk"                           
brew "cmatrix"
brew "fd"                         
brew "htop"                       
brew "bat"                        
# brew "btop"                       
# brew "jq"                         
# brew "yq"                         
# brew "tldr"                       
# brew "zoxide"                     

brew "p7zip"                       
brew "unzip"                       
brew "gzip"                        

# brew "duckdb"                     
# brew "sqlite"                     
# brew "mongodb/brew/mongodb-database-tools"     
# brew "mongodb/brew/mongodb-community"          

brew "node"                       
brew "nvm"
# brew "python@3.12"                
# brew "pipx"                       
# brew "go"                         

# brew "hashicorp/tap/terraform"    
# brew "docker"                     
# brew "docker-compose"             
# brew "kubectl"                    
# brew "helm"                       

brew "lazygit"                    

brew "fonttools"                  

cask "font-0xproto-nerd-font"
cask "font-fira-code-nerd-font"           
cask "font-jetbrains-mono-nerd-font"      
# cask "font-meslo-lg-nerd-font"            
# cask "font-hack-nerd-font"                

brew "mas"                        
brew "mackup"                     
brew "smudge/smudge/nightlight"   
cask "flux-app"

cask "ghostty"                    
cask "figma"
# cask "orbstack"                   
# cask "visual-studio-code"         
# cask "docker"                     

cask "rectangle"                  
cask "notion"                     
# cask "alt-tab"                    

cask "firefox"                    
cask "google-chrome"              

# cask "slack"                      
# cask "discord"                    
# cask "zoom"                       

cask "vlc"                        
# cask "imageoptim"                 
# cask "the-unarchiver"             
# cask "cleanmymac"                 

# mas "Amphetamine", id: 937984704              
# mas "Xcode", id: 497799835                    
# mas "The Unarchiver", id: 425424353           

# cask "amazon-q"
